#+TITLE: Introduction to Python for Applied Calculus
#+AUTHOR: Umberto Fasci
#+DESCRIPTION: Programming now has relevance well beyond just Computer Science. In this module and throughout this course, you will learn not only about programming using Python, but also how to use those skills to solve real, complex problems in future classes, at work, or elsewhere. To ensure this, copious amounts of examples are included, with explanations, throughout the course. You are strongly encouraged not only trace through them, but also experiment with (run, alter, break) them on your own. The assignments are linked to the respective module. Putting time in here will give you the opportunity to solve actual scientific problems and challenge you in a way that that’ll not only help you make use of the skills we’ll discuss in lecture, but also to leave you with that oh-so-satisfying feeling of having conquered the challenge when you’re done!

** Functions in Action

To call a function, we can have our function declared as we have done above and then call it by typing its name along with the input.

For example:

#+begin_src jupyter-python
def double(x):
    x = x*2
    return x
#+end_src

#+RESULTS:

#+begin_src jupyter-python
a = double(2)
b = double(3)
c = double(4)

print(a, b, c)
#+end_src

#+RESULTS:
: 4 6 8

With this (a, b, c) would equal (4, 6, 8) respectivly.

*** Exercise 1

- Write a Python Function that takes three inputs.
- The function should add these three numbers together and return a sum.
- Write a Python statement that will execute the function.
- Use # to add a brief description of what your function is doing.

#+begin_src jupyter-python
def addition(x,y,z):
    # Returns the sum of x, y, and z.
    sum = x + y + z
    return sum

addition(2, 4, 6)
#+end_src

  #+RESULTS:
  : 12

*** Exercise 2

*Problem*:
- You have a friend studying abroad in a country that lists the temperature in Celsius.
- Your friend is more familiar with Fahrenheit. You'd like to write a program that will do the conversion for your friend.

The Celsius to Fahrenheit conversion equation:

$$F = 9/5 * (C) + 32$$

#+begin_src jupyter-python
def temp_conv(C):
    # Convert Celsius to Fahrenheit.
    F = 9/5 * (C) + 32
    return F

temp_conv(37.77)
#+end_src

  #+RESULTS:
  : 99.986

**** Test Exercise Code

- 0 Celsius is 32.0 degrees Fahrenheit.
- 100 Celsius is 212.0 degrees Fahrenheit.

#+begin_src jupyter-python
print(temp_conv(0))
print(temp_conv(100))
#+end_src

#+RESULTS:
: 32.0
: 212.0



** Definite Loops

A /definite/ loop executes a definite number of times, i.e., at the time Python starts the loop it knows
exactly how many /iterations/ to do.

for <var> in <sequence>:
    <body>

The beginning and end of the body are indicated by indentation.

For example:

#+begin_src jupyter-python
values = [54, 76, 100]

for value in values:
    print(value*2)
#+end_src

#+RESULTS:
: 108
: 152
: 200

*** Exercise

*Temperature Conversion*

$$F = 9/5 * (C) + 32$$

Use a for loop to convert a list of temps.

#+begin_src jupyter-python
temps = [0, 100, 38]

for temp in temps:
    print(9/5 * (temp) + 32)
#+end_src

#+RESULTS:
: 32.0
: 212.0
: 100.4

*** Exercise

Once again using temperature conversion as an example...

Try modifying the program so that it converts all the temperatures from 0 to 100 Celsius in steps of 5.

#+begin_src jupyter-python
for temp in range(0, 100, 5):
    print(9/5 * (temp) + 32)
#+end_src

#+RESULTS:
#+begin_example
32.0
41.0
50.0
59.0
68.0
77.0
86.0
95.0
104.0
113.0
122.0
131.0
140.0
149.0
158.0
167.0
176.0
185.0
194.0
203.0
#+end_example

** Indefinite Loops

The for loop is called a "definite loop" because we know in advance how many times it will execute.

We *definitely* know when it will end.

The opposite is known as an "indefinite loop"

An example of an indefinite loop would be the *while* loop.

This type of loop will execute until a condition is /true/.

For example:

#+begin_src jupyter-python
x = 10
while x < 100:
    x = x + 3

print(x)
#+end_src

#+RESULTS:
: 100

This loop will execute continuously until the ~x~ variable is overwritten with a value greater than 100.


** Control Statements

#+begin_src jupyter-python
x = 10

if (x > 5):
    print("Greater than 5") # This will print.
#+end_src

#+RESULTS:
: Greater than 5

** Numpy

Lists can hold multiple values, but they cannot be treated as vectors.

For example:

#+begin_src jupyter-python
a = [1, 2, 3]
b = [4, 5, 6]

c = a * b # this will generate an error.
#+end_src

With numpy, you can use lists as vectors in a mathematical sense.

For example:

#+begin_src jupyter-python
import numpy as np

a = np.array([1, 2, 3])
b = np.array([4, 5, 6])

c = a * b

print(c)
#+end_src

#+RESULTS:
: [ 4 10 18]

*Results:*

[4, 10, 18]

*** A handy use of lists

#+begin_src jupyter-python
x = []
for i in range(10):
    x.append(i*2)

x
#+end_src

#+RESULTS:
| 0 | 2 | 4 | 6 | 8 | 10 | 12 | 14 | 16 | 18 |

With empty lists you can, in practice, store results. In this case the result from this code would return a list:

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]





*** More on Floating-Point Numbers

Floating-point numbers are sometimes given in scientific notations. For example,

#+begin_src jupyter-python
1.23e4
#+end_src

#+RESULTS:
: 12300.0

This represents $1.23 \times 10^4 = 12300$.

** Symbols

To use variables as unknowns, we define them with *symbols()*.

symbols() can be used to define multiple variables at once, in a string separated by spaces or commas.

Like python variables, symbols may have names longer than one character.

#+begin_src jupyter-python
# Define a single symbol
x = symbols('x')

# Define three symbols at once
a, b, c = symbols('a, b, c')

# Define a multi-character symbol
tau = symbols('tau')
#+end_src

#+RESULTS:

As an example, running the following code without defining x results in an error. Defining x as a symbol results in the expression x + 1.

#+begin_src jupyter-python
x = symbols('x')

x + 1
#+end_src

#+RESULTS:
#+begin_export latex
$\displaystyle x + 1$
#+end_export

~This exports automatically as LaTex, I will review how this renders in the git view.~

*** Substitution

Suppose we want to substitute a value for the variable x in an expression, say x = 5.
Typing ~x = 5~ will just redefine the Python variable, rather than changing the expression.

Instead, we must use ~subs(x,5)~

#+begin_src jupyter-python
# Define the symbol
x = symbols('x')

# Define an expression
expression = 2*x - 1

# Substitute 5 for x
expression.subs(x, 5)
#+end_src

#+RESULTS:
#+begin_export latex
$\displaystyle 9$
#+end_export

